var name = localStorage.getItem('name');
var band = localStorage.getItem('band');
var OT = localStorage.getItem('OT_Liqure');
var dance = localStorage.getItem('dance');
if (band == 2) {
	if (OT == 2) {
		var content = "\(전화가 울린다.\)§※컴공 19 김강재: " + name + "맞지?§§\"네 안녕하세요!!!\"§\'오티 때 취해서 쓰러진거 선배는 모르겠지..? 제발..\'§§※컴공 19 김강재: ㅋㅋㅋㅋㅋㅋ 너 그 때 쓰러지고 기억나?? 안나겠지?§§\"네?!?!?,,,\"§\'아.. 망했다...\'§§컴공 19 김강재: 너 쓰러지고 난리통에 사람들 어쩌지 어쩌지하다가 내가 너 들어서 택시 태워서 보냈어..§§\"......\"§※\'편입할까..? 말도안돼... 제발\'§§※컴공 19 김강재: 그래도 머 신입생땐 다 그러니까 머 괜찮아 난 더 심했거든 ㅋㅋㅋㅋ§§\"죄송해요 선배..\"§§컴공 19 김강재: 아무튼 다름이 아니라 너 동아리 들어온다 했잖아 내일부터 일주일간 면접이거든 3시에 학교 옆에 있는 건물에 METRO 동아리방으로 찾아오면 돼!!§알았지?? 나 급하게 합주해야돼서 끊는다 ?? 기대할게 !!!!§§※(전화가 급하게 끊어졌다.)§§※(컴공 19학번 김강재의 주소록이 업데이트 되었다!)§§※\"으 망했다... 어떻게 준비해야하지...ㅜㅜ\"§§※(3일후※.※.※.)§※\'아 건물은 여기가 맞는데 동아리방이 어딘지 모르겠다ㅜㅜ 큰일이야 곧 3신데\'§§???: 저.. 저기요§§●\"네네??!!\"§§21학번 이도현: 저.. 심리학과 21학번 이도현이고 이번에 METRO 면접보러 왔는데 혹시 면접보러 오셨나여?!§§\"헐 네네네 맞아요 ㅜㅜ 근데 길을 못찾고 있어서 아아 저도 21학번이고 컴공이에요!\"§§21학번 이도현: 헐 진짜 너무 반갑다.... 동방 저기에요!! 같이 갈까요??§§\"헐 좋아요 동방.. ? 동방이 머에요??\"§§21학번 이도현: 동아리방이요 ㅋㅋㅋ 귀엽다ㅎㅎ §§\"앜ㅋㅋㅋ 그렇구나..\"§§※(면접을 기다린다)§※\"근데 다행이다.. 도현씨 없었으면 큰일날뻔했어요ㅜㅜ\"§§21학번 이도현: 도현씨 뭐야 ~~ 오글 ㅜㅜ 우리 말 놓자!!§§\"너무좋지 사실 뭐라고 부를지 고민하고있었...\"§§※???: 네 다음 이도현씨 들어오세요!~~§§※21학번 이도현: 헐 내 차례다 어쩌지 ㅜㅜㅜ  떨려§§\"괜찮아 !! 화이팅!!! 잘보구와~~\"§§※(동방에서 노래 소리가 들린다)§§※\'와 도현이 보컬이구나 노래 진짜 잘한다.. 나 무섭다.. 아무것도 못하는데 더 떨려... 큰일이네..\'§§※???: 네 다음 " + name + "씨 들어오세요!!!!§§※21학번 이도현: ... 생각보다 분위기가 무서운데??... 화이팅... 기다릴게!§§※\"헐 어떡해.. 아 떨려\"§§※(여러가지 질문들이 오갔지만 생각보다 면접이 잘 진행되었다.)§§???: 이제 마음대로 동방 이용 하시고 잘 지내봐요 다같이 !!§§\"네 감사합니다!!!!\"§§21학번 이도현: 어때 잘 봤어???§§\"응응! 이제 동방 써도된대!!\"§§21학번 이도현: 헐 너무좋다ㅜ 우리같이 합주도 하고 그러자 내가 번호줄게!!!§§※(주소록에 심리학과 21학번 이도현이 추가되었다!)§§※(Metro 동아리에 입부하였다!)■";
		localStorage.setItem('Metro', 2);
		localStorage.setItem('LeeDoHyeon', 2);	
		localStorage.setItem('LeeDoHyeon1', 2);
		localStorage.setItem('KimGangJae2', 2);
	}
	else {
		var content = "☆" + "\(수업을 듣고 집에 가려는 와중 홍보포스터를 보게된다.\)§§\'아.. 면접기간 곧 끝나가네... 동아리... 은혜언니가 말한 것 처럼 안들어가면 후회하겠지..?\'§§오늘 시간 비니까 면접보고 와야겠다!!\'§§※(겨우겨우 장소를 찾아 면접을 본다.)§§※???: 혹시 지원하시는 파트가 어떻게 되세요??§\"저.. 기타 지원했습니다!!!\"§§???: 혹시 준비 하신 기타 곡 있으신가요?§§\"아.. 아뇨 제가 사실 기타는 처음이고 배우고 싶어서 지원했습니다ㅜ\"§§???: 아 그렇군요 혹시 기타는 집에 있나요?§§\"아.. 아뇨...\"§(큰일났다...ㅜㅜ 느낌이 안좋은데ㅜㅜ)§§※???: 오늘 면접 수고 많으셨고 오늘 중으로 문자로 결과 알려드리겠습니다! 수고하셨어요~~~!!§§※\"네 감사합니다!!!\"§§※(2시간 뒤※.※.※.)§§※\"아 설레... 문자 왔다...\"§\"어디보자... 죄송합니다.. 이번에 기타 지원자가 너무 많아 초심자를 다 가르치기 벅차 불합격을 통보 드립니다.\"§§※\"※.※.※.※. 나 울어버릴까※.※.※.\"§§※은혜언니: 응응 무슨일이야??§§※\"나 면접 떨어졌엉응아아으으ㅏ아아아ㅏㅡㅜㅜㅜㅜㅜㅜㅜ\"§§은혜언니: 울지마 바보야 나도 남자친구랑 방금 헤어졌단 말이야 응아아아아아ㅏ아ㅜㅜ아아아ㅡㅡㅜㅜ아ㅏ아ㅏㅏ§§※(고등학교 선배 지은혜 언니의 주소록이 업데이트 되었다.)■";		
		localStorage.setItem('JiEunhye2', 2);
	}
}
else if (dance == 2){
	if (OT == 2) {
		var content = "\'근데 생각해보니까 동아리 권유 받은지 꽤 시간이 지났는데 은혁선배한테 아직 연락이 없네.. 어쩌지\'§§※(다급한 목소리가 들린다.)§※20학번 이은혁: " + name + "아!!!!!!!! 헉헉..§§※ ★\"어!!!! 선배 안녕하세요..\"§§※20학번 이은혁: 후... 너가 지나간거 같아서 바로 뛰어왔어... 그.. 오티 때 전화번호 줬잖아.. 면접보라고 하려했는데 없는 전화번호라고 ㅜ 너가 잘못 준거 같아§§\"네?!?!! 헐 실수했나봐요 죄송해요ㅜㅜㅜ 왠지 연락이 없으셔서 동아리 인원 꽉 찬줄 알고ㅜㅜ\"§§20학번 이은혁: 아냐아냐! 그래서 말인데.. 면접이 사실 오늘까지거든... 지금 당장 면접보러 갈 수 있어??§§\".... 근데 저 딱히 준비한게\"§§20학번 이은혁: 괜찮아 빨리가자 !!!!§§※(허둥지둥 끌려가 면접을 보게된다.)§§※???: 혹시 준비한 춤을 보여주실 수 있으신가요??§§※\'아 다행이다※.※. 그래도 요즘 최신곡은 많이 연습해놔서ㅜㅜㅜ\'§§※(춤을 춘다.)§§※???: 네 지금까지 면접보느라 수고하셨고 다음부턴 동아리 이용해도 됩니다!!!§§20학번 이은혁: 수고했어!! 와 내 생각보다 너 춤 엄청 잘추던데??? 나랑 같이 연습해서 공연하자!!!§§\"에이.. 아니에요.. 거짓말이죠?\"§§20학번 이은혁: 아니 진짜로!! 이런 인재가 들어오다니 선배가 후배보다 못하면 안되니까 연습 더 열심히 해야겠다ㅜㅜ§다시 한 번 오늘 너무 수고했고 집 조심히들어가!!! 나는 과제하러 ㅜㅜㅜ§§\"네넵!!! 감사합니다. 담에 뵈어요!!\"§§※(영상 20학번 이은혁의 주소록이 업데이트 되었다.)§§※(DO 동아리에 입부하였다!)■";
		localStorage.setItem('DO', 2);	
		localStorage.setItem('LeeEunhyeok2', 2);
	}
	else {
		var content = "지나가던 학생들: 야야!! 너 댄스 동아리 면접 잘 봤어!!??? 물론이지 내가 누군데!!! 근데 면접 날짜 오늘까지인지 까먹어서 큰일날 뻔 했어ㅜㅜ§§※\'헐 댄스동아리 면접 오늘까지인가보네.. 어쩌지.. 아ㅜㅜㅜ\'§\'그래 ! 은혜언니 말대로 동아리 안들어가면 후회할거야\'§§※(겨우겨우 면접장을 찾아 면접을 본다.)§§※???: 네 마지막으로 준비한 춤 볼 수 있을까요??§§※\'헉... 갑자기 추려니까 기억이 안나네... 어떡해 미치겠다...\'§§※(춤을 췄으나 평소보다 잘 추지 못했다.)§§※???: 지금까지 면접 보시느라 수고하셨습니다!!! 합격일 경우 오늘 중 문자를 보내겠습니다!!§\"네 !!! 감사합니다.. 잘 부탁드립니다!!\"§§※(하루가 지났다.)§§※\"※.※.※.※. 나 울어버릴까※.※.※.\"§§※은혜언니: 응응 무슨일이야??§§\"나 면접 떨어졌엉응아아으으ㅏ아아아ㅏㅡㅜㅜㅜㅜㅜㅜㅜ\"§§은혜언니: 울지마 바보야 나도 남자친구랑 방금 헤어졌단말이야 응아아아아아ㅏ아ㅜㅜ아아아ㅡㅡㅜㅜ아ㅏ아ㅏㅏ§§(고등학교 선배 지은혜 언니의 주소록이 업데이트 되었다.)■";
		localStorage.setItem('JiEunhye2', 2);
	}
}
else {
	var content = "(어느 점심시간.. )§§※\"아 점심을 먹어야 되는데 식당들 다 꽉 차서 먹을 곳이 없네.... 하... 시간도 없는데 학식 줄도 너무 길고 화난다! 편의점이라도 가야되나?..\"§§(편의점을 가서 수많은 인파 속에 비집고 들어가 도시락을 샀다.)§§§※\"헤헤.. 그래도 밥 샀다. 휴게실에서 밥 먹어야지!\"§§※터벅.. 터벅※.※.※.※.§§\"어? 휴게실에도 왜 이리 사람이 많아?!!! 어쩌지.. 이제 10분 밖에 안 남았는데.. 하......\"§§※조용히 화장실에 들어갔다...§§※\"아무도 없겠지?...\"§§화장실 칸에 들어가서 변기 커버를 내리고 도시락을 까서 먹었다....§§§\"하... 아는 사람이라도 있었으면 자리라도 맡아줬을텐데...\"§§빠른 속도로 점심을 먹고 수업에 쓸쓸히 들어갔다.■";
}

const text = document.querySelector(".text");
var index = 0;

function typing(){
	if (content[index] == '§') //강제 개행
	{
		text.innerHTML += '<br/>';
		index++;
	}
	else if (content[index] == '※') 
	{
		index++;
		text.innerHTML += content[index++];	
		sleep(700);
	}
	else if (content[index] == '●')
	{
		text.innerHTML += '<img src="leedo01.jpg" height="150" width="250" style="margin-left:35px; border: 1px solid #2EE59D"><br/><br/>';
		index++;
	}
	else if (content[index] == '★')
	{
		text.innerHTML += '<img src="leeeun02.jpg" height="150" width="250" style="margin-left:35px; border: 1px solid #2EE59D"><br/><br/>';
		index++;
	}
	else if (content[index] == '☆')
	{
		text.innerHTML += '<img src="poster.jpg" height="150" width="250" style="margin-left:35px; border: 1px solid #2EE59D"><br/><br/>';
		index++;
	}
	else if (content[index] == '■') {
		sleep(1000);
		index++;
		text.innerHTML += '<br/><br/><br/><br/><br/><a onclick="select();" rel="external" style="float:right">다음..</a>';
	}
	else text.innerHTML += content[index++];
	
	if(index >= content.length){
		clearInterval(Id);
	}
}

$('div[id="content_start"]').on("tap", function(){
	clearInterval(Id);
	
if (band == 2) {
	if (OT == 2) {
		text.innerHTML = "\(전화가 울린다.\)<br/>컴공 19 김강재: " + name + "맞지?<br/><br/>\"네 안녕하세요!!!\"<br/>\'오티 때 취해서 쓰러진거 선배는 모르겠지..? 제발..\'<br/><br/>컴공 19 김강재: ㅋㅋㅋㅋㅋㅋ 너 그 때 쓰러지고 기억나?? 안나겠지?<br/><br/>\"네?!?!?,,,\"<br/>\'아.. 망했다...\'<br/><br/>컴공 19 김강재: 너 쓰러지고 난리통에 사람들 어쩌지 어쩌지하다가 내가 너 들어서 택시 태워서 보냈어..<br/><br/>\"......\"<br/>\'편입할까..? 말도안돼... 제발\'<br/><br/>컴공 19 김강재: 그래도 머 신입생땐 다 그러니까 머 괜찮아 난 더 심했거든 ㅋㅋㅋㅋ<br/><br/>\"죄송해요 선배..\"<br/><br/>컴공 19 김강재: 아무튼 다름이 아니라 너 동아리 들어온다 했잖아 내일부터 일주일간 면접이거든 3시에 학교 옆에 있는 건물에 METRO 동아리방으로 찾아오면 돼!!<br/>알았지?? 나 급하게 합주해야돼서 끊는다 ?? 기대할게 !!!!<br/><br/>(전화가 급하게 끊어졌다.)<br/><br/>(컴공 19학번 김강재의 주소록이 업데이트 되었다!)<br/><br/>\"으 망했다... 어떻게 준비해야하지...ㅜㅜ\"<br/><br/>(3일후...)<br/>\'아 건물은 여기가 맞는데 동아리방이 어딘지 모르겠다ㅜㅜ 큰일이야 곧 3신데\'<br/><br/>???: 저.. 저기요<br/><br/><img src=\"leedo01.jpg\" height=\"150\" width=\"250\" style=\"margin-left:35px; border: 1px solid #2EE59D\"><br/><br/>\"네네??!!\"<br/><br/>21학번 이도현: 저.. 심리학과 21학번 이도현이고 이번에 METRO 면접보러 왔는데 혹시 면접보러 오셨나여?!<br/><br/>\"헐 네네네 맞아요 ㅜㅜ 근데 길을 못찾고 있어서 아아 저도 21학번이고 컴공이에요!\"<br/><br/>21학번 이도현: 헐 진짜 너무 반갑다.... 동방 저기에요!! 같이 갈까요??<br/><br/>\"헐 좋아요 동방.. ? 동방이 머에요??\"<br/><br/>21학번 이도현: 동아리방이요 ㅋㅋㅋ 귀엽다ㅎㅎ <br/><br/>\"앜ㅋㅋㅋ 그렇구나..\"<br/><br/>(면접을 기다린다)<br/>\"근데 다행이다.. 도현씨 없었으면 큰일날뻔했어요ㅜㅜ\"<br/><br/>21학번 이도현: 도현씨 뭐야 ~~ 오글 ㅜㅜ 우리 말 놓자!!<br/><br/>\"너무좋지 사실 뭐라고 부를지 고민하고있었...\"<br/><br/>???: 네 다음 이도현씨 들어오세요!~~<br/><br/>21학번 이도현: 헐 내 차례다 어쩌지 ㅜㅜㅜ  떨려<br/><br/>\"괜찮아 !! 화이팅!!! 잘보구와~~\"<br/><br/>(동방에서 노래 소리가 들린다)<br/><br/>\'와 도현이 보컬이구나 노래 진짜 잘한다.. 나 무섭다.. 아무것도 못하는데 더 떨려... 큰일이네..\'<br/><br/>???: 네 다음 " + name + "씨 들어오세요!!!!<br/><br/>21학번 이도현: ... 생각보다 분위기가 무서운데??... 화이팅... 기다릴게!<br/><br/>\"헐 어떡해.. 아 떨려\"<br/><br/>(여러가지 질문들이 오갔지만 생각보다 면접이 잘 진행되었다.)<br/><br/>???: 이제 마음대로 동방 이용 하시고 잘 지내봐요 다같이 !!<br/><br/>\"네 감사합니다!!!!\"<br/><br/>21학번 이도현: 어때 잘 봤어???<br/><br/>\"응응! 이제 동방 써도된대!!\"<br/><br/>21학번 이도현: 헐 너무좋다ㅜ 우리같이 합주도 하고 그러자 내가 번호줄게!!!<br/><br/>(주소록에 심리학과 21학번 이도현이 추가되었다!)<br/><br/>(Metro 동아리에 입부하였다!)<br/><br/><br/><br/><br/><a onclick=\"select();\" rel=\"external\" style=\"float:right\">다음..</a>";
	}
	else {
		text.innerHTML = "<img src=\"poster.jpg\" height=\"150\" width=\"250\" style=\"margin-left:35px; border: 1px solid #2EE59D\"><br/><br/>\(수업을 듣고 집에 가려는 와중 홍보포스터를 보게된다\)<br/><br/>\'아.. 면접기간 곧 끝나가네... 동아리... 은혜언니가 말한 것 처럼 안들어가면 후회하겠지..?\'<br/><br/>오늘 시간 비니까 면접보고 와야겠다!!\'<br/><br/>(겨우겨우 장소를 찾아 면접을 본다.)<br/><br/>???: 혹시 지원하시는 파트가 어떻게 되세요??<br/>\"저.. 기타 지원했습니다!!!\"<br/><br/>???: 혹시 준비 하신 기타 곡 있으신가요?<br/><br/>\"아.. 아뇨 제가 사실 기타는 처음이고 배우고 싶어서 지원했습니다ㅜ\"<br/><br/>???: 아 그렇군요 혹시 기타는 집에 있나요?<br/><br/>\"아.. 아뇨...\"<br/>(큰일났다...ㅜㅜ 느낌이 안좋은데ㅜㅜ)<br/><br/>???: 오늘 면접 수고 많으셨고 오늘 중으로 문자로 결과 알려드리겠습니다! 수고하셨어요~~~!!<br/><br/>\"네 감사합니다!!!\"<br/><br/>(2시간 뒤...)<br/><br/>\"아 설레... 문자 왔다...\"<br/>\"어디보자... 죄송합니다.. 이번에 기타 지원자가 너무 많아 초심자를 다 가르치기 벅차 불합격을 통보 드립니다.\"<br/><br/>\".... 나 울어버릴까...\"<br/><br/>은혜언니: 응응 무슨일이야??<br/><br/>\"나 면접 떨어졌엉응아아으으ㅏ아아아ㅏㅡㅜㅜㅜㅜㅜㅜㅜ\"<br/><br/>은혜언니: 울지마 바보야 나도 남자친구랑 방금 헤어졌단 말이야 응아아아아아ㅏ아ㅜㅜ아아아ㅡㅡㅜㅜ아ㅏ아ㅏㅏ<br/><br/>(고등학교 선배 지은혜 언니의 주소록이 업데이트 되었다.)<br/><br/><br/><br/><br/><a onclick=\"select();\" rel=\"external\" style=\"float:right\">다음..</a>";		
	}
}
else if (dance == 2) {
	if (OT == 2) {
		text.innerHTML = "\'근데 생각해보니까 동아리 권유 받은지 꽤 시간이 지났는데 은혁선배한테 아직 연락이 없네.. 어쩌지\'<br/><br/>(다급한 목소리가 들린다.)<br/>20학번 이은혁: " + name + "아!!!!!!!! 헉헉..<br/><br/><img src=\"leeeun02.jpg\" height=\"150\" width=\"250\" style=\"margin-left:35px; border: 1px solid #2EE59D\"><br/><br/>\"어!!!! 선배 안녕하세요..\"<br/><br/>20학번 이은혁: 후... 너가 지나간거 같아서 바로 뛰어왔어... 그.. 오티 때 전화번호 줬잖아.. 면접보라고 하려했는데 없는 전화번호라고 ㅜ 너가 잘못 준거 같아<br/><br/>\"네?!?!! 헐 실수했나봐요 죄송해요ㅜㅜㅜ 왠지 연락이 없으셔서 동아리 인원 꽉 찬줄 알고ㅜㅜ\"<br/><br/>20학번 이은혁: 아냐아냐! 그래서 말인데.. 면접이 사실 오늘까지거든... 지금 당장 면접보러 갈 수 있어??<br/><br/>\".... 근데 저 딱히 준비한게\"<br/><br/>20학번 이은혁: 괜찮아 빨리가자 !!!!<br/><br/>(허둥지둥 끌려가 면접을 보게된다.)<br/><br/>???: 혹시 준비한 춤을 보여주실 수 있으신가요??<br/><br/>\'아 다행이다.. 그래도 요즘 최신곡은 많이 연습해놔서ㅜㅜㅜ\'<br/><br/>(춤을 춘다.)<br/><br/>???: 네 지금까지 면접보느라 수고하셨고 다음부턴 동아리 이용해도 됩니다!!!<br/><br/>20학번 이은혁: 수고했어!! 와 내 생각보다 너 춤 엄청 잘추던데??? 나랑 같이 연습해서 공연하자!!!<br/><br/>\"에이.. 아니에요.. 거짓말이죠?\"<br/><br/>20학번 이은혁: 아니 진짜로!! 이런 인재가 들어오다니 선배가 후배보다 못하면 안되니까 연습 더 열심히 해야겠다ㅜㅜ<br/>다시 한 번 오늘 너무 수고했고 집 조심히들어가!!! 나는 과제하러 ㅜㅜㅜ<br/><br/>\"네넵!!! 감사합니다. 담에 뵈어요!!\"<br/><br/>(영상 20학번 이은혁의 주소록이 업데이트 되었다.)<br/><br/>(DO 동아리에 입부하였다!)<br/><br/><br/><br/><br/><a onclick=\"select();\" rel=\"external\" style=\"float:right\">다음..</a>";
	}
	else {
		text.innerHTML = "지나가던 학생들: 야야!! 너 댄스 동아리 면접 잘 봤어!!??? 물론이지 내가 누군데!!! 근데 면접 날짜 오늘까지인지 까먹어서 큰일날 뻔 했어ㅜㅜ<br/><br/>\'헐 댄스동아리 면접 오늘까지인가보네.. 어쩌지.. 아ㅜㅜㅜ\'<br/>\'그래 ! 은혜언니 말대로 동아리 안들어가면 후회할거야\'<br/><br/>(겨우겨우 면접장을 찾아 면접을 본다.)<br/><br/>???: 네 마지막으로 준비한 춤 볼 수 있을까요??<br/><br/>\'헉... 갑자기 추려니까 기억이 안나네... 어떡해 미치겠다...\'<br/><br/>(춤을 췄으나 평소보다 잘 추지 못했다.)<br/><br/>???: 지금까지 면접 보시느라 수고하셨습니다!!! 합격일 경우 오늘 중 문자를 보내겠습니다!!<br/>\"네 !!! 감사합니다.. 잘 부탁드립니다!!\"<br/><br/>(하루가 지났다.)<br/><br/>\".... 나 울어버릴까...\"<br/><br/>은혜언니: 응응 무슨일이야??<br/><br/>\"나 면접 떨어졌엉응아아으으ㅏ아아아ㅏㅡㅜㅜㅜㅜㅜㅜㅜ\"<br/><br/>은혜언니: 울지마 바보야 나도 남자친구랑 방금 헤어졌단말이야 응아아아아아ㅏ아ㅜㅜ아아아ㅡㅡㅜㅜ아ㅏ아ㅏㅏ<br/><br/>(고등학교 선배 지은혜 언니의 주소록이 업데이트 되었다.)<br/><br/><br/><br/><br/><a onclick=\"select();\" rel=\"external\" style=\"float:right\">다음..</a>";
	}
}
else {
	text.innerHTML = "(어느 점심시간.. )<br/><br/>\"아 점심을 먹어야 되는데 식당들 다 꽉 차서 먹을 곳이 없네.... 하... 시간도 없는데 학식 줄도 너무 길고 화난다! 편의점이라도 가야되나?..\"<br/><br/>(편의점을 가서 수많은 인파 속에 비집고 들어가 도시락을 샀다.)<br/><br/><br/>\"헤헤.. 그래도 밥 샀다. 휴게실에서 밥 먹어야지!\"<br/><br/>터벅.. 터벅....<br/><br/>\"어? 휴게실에도 왜 이리 사람이 많아?!!! 어쩌지.. 이제 10분 밖에 안 남았는데.. 하......\"<br/><br/>조용히 화장실에 들어갔다...<br/><br/>\"아무도 없겠지?...\"<br/><br/>화장실 칸에 들어가서 변기 커버를 내리고 도시락을 까서 먹었다....<br/><br/><br/>\"하... 아는 사람이라도 있었으면 자리라도 맡아줬을텐데...\"<br/><br/>빠른 속도로 점심을 먹고 수업에 쓸쓸히 들어갔다.<br/><br/><br/><br/><br/><a onclick=\"select();\" rel=\"external\" style=\"float:right\">다음..</a>";
}
}); // 모바일 환경에서 터치를 하였을 때

function sleep(ms) {
  const wakeUpTime = Date.now() + ms;
  while (Date.now() < wakeUpTime) {}
} // Sleep


function select() {
	var Metro = localStorage.getItem('Metro');
	var DO = localStorage.getItem('DO');
	var LeeDoHyeon = localStorage.getItem('LeeDoHyeon');
	var LeeGaEun = localStorage.getItem('LeeGaEun');
	
	if (Metro == 2) {
		if ((LeeGaEun == 2) && (LeeDoHyeon == 2)) {
			location.href = '7(LL).html';
		}
		else if ((LeeDoHyeon == 2)) {
			location.href = '7(L).html';
		}
		else if (LeeGaEun == 2) {
			location.href = '7(LG).html';
		}
	}
	else if (DO == 2) {
		if (LeeGaEun == 2) {
			location.href = '7(DO_LG).html';
		}
		else {
			location.href = '7(DO_X).html';
		}
	}
	else {
		location.href = '7(X).html';
	}
}

var Id = setInterval(typing, 25);